# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0
  - [0, 1, nn.Upsample, [None, 0.25, "nearest"]] # 1
  - [0, 1, nn.Upsample, [None, 0.125, "nearest"]] # 2
  - [0, 1, nn.Upsample, [None, 0.0625, "nearest"]] # 3
  - [0, 1, nn.Upsample, [None, 0.03125, "nearest"]] # 4
  
  - [1, 1, ConvS, [64, 3, 1]] # 5-z1-0
  - [-1, 3, C2fSD, [64, True]] # 6

  - [1, 1, Conv, [64, 3, 2]] # 7-z2-0
  - [2, 1, Conv, [64, 3, 1]] # 8-z2-0
  - [[-1, -2], 1, Concat, [1]] # 9
  - [-1, 3, C2fSD, [64, True]] # 10

  - [2, 1, Conv, [64, 3, 2]] # 11-z3-0
  - [3, 1, Conv, [64, 3, 1]] # 12-z3-0
  - [[-1, -2], 1, Concat, [1]] # 13
  - [-1, 3, C2fSD, [64, True]] # 14

  - [3, 1, Conv, [64, 3, 2]] # 15-z4-0
  - [4, 1, Conv, [64, 3, 1]] # 16-z4-1
  - [[-1, -2], 1, Concat, [1]] ##17
  - [-1, 3, C2fSD, [64, True]] ##18
  - [-1, 1, PSASD, [64, 1]] # 19



  - [0, 1, ConvS, [64, 3, 2]] # 20-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 21-P2/4
  - [[-1, 6], 1, Concat, [1]] # 22
  - [-1, 3, C2fSD, [128, True]] # 23
  - [[-1, 6], 1, Concat, [1]] # 24
  - [-1, 1, Conv, [256, 3, 2]] # 25-P3/8
  - [[-1, 10], 1, Concat, [1]] # 26
  - [-1, 6, C2fSD, [256, True]] # 27

  - [[-1, 10], 1, Concat, [1]] # 28
  - [-1, 1, SCDown, [512, 3, 2]] # 29-P4/16
  - [[-1, 14], 1, Concat, [1]] # 30
  - [-1, 6, C2fSD, [512, True]] # 31

  - [[-1, 14], 1, Concat, [1]] # 32
  - [-1, 1, SCDown, [1024, 3, 2]] # 33-P5/32



  - [[-1, 19, 18], 1, Concat, [1]] # 34
  - [-1, 3, C2fCIB, [1024, True, True]] # 35



  - [[-1, 19, 18], 1, Concat, [1]] # 36
  - [-1, 1, SPPFS, [1024, 5]] # 37
  
  - [[-1, 19, 18], 1, Concat, [1]] # 38
  - [-1, 1, PSAS, [1024]] # 39
  

  - [-1, 1, SCDown, [512, 3, 2]] # 40
  - [-1, 1, PSAS, [512]] #41
  - [-1, 1, SCDown, [512, 3, 2]] # 42
  - [-1, 1, ToConvWeight, [448, 7]] #43

  - [-1, 1, SplitConv2dResult, [0, 128]] #44
  - [-2, 1, SplitConv2dResult, [128, 192]] #45
  - [-3, 1, SplitConv2dResult, [320, 128]] #46


# YOLOv8.0n head
head:
  - [[10, 44], 1, DynamicThroughConvS, [128]] ##47
  - [-1, 1, SplitConv2dResult, [0, 64]] ##48
  - [-2, 1, SplitConv2dResult, [64,64]] ##49
  
  - [[14, 45], 1, DynamicThroughConvS, [192]] # 50
  - [-1, 1, SplitConv2dResult, [0,  64]] ##51
  - [-2, 1, SplitConv2dResult, [64, 64]] ##52
  - [-3, 1, SplitConv2dResult, [128,64]] ##53

  - [[18, 46], 1, DynamicThroughConvS, [128]] ##54
  - [-1, 1, SplitConv2dResult, [0,  64]] ##55
  - [-2, 1, SplitConv2dResult, [64, 64]] ##56

  
  - [[-1, 39], 1, Concat, [1]] # 57
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 58
  - [[-1, 31, 14, 51], 1, Concat, [1]] # 59
  - [-1, 3, C2fSD, [512]] # 60

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 61
  - [[-1, 27, 10, 48], 1, Concat, [1]] # 62
  - [-1, 3, C2fSD, [256]] # 63 (P3/8-small)
  
  - [[-1, 10, 49], 1, Concat, [1]] # 64-cat backbone P3
  - [-1, 1, Conv, [256, 3, 2]] # 65
  - [[-1, 60, 14, 52], 1, Concat, [1]] # 66
  - [-1, 3, C2fSD, [512]] # 67 (P4/16-medium)
  
  - [[-1, 14, 53], 1, Concat, [1]] # 68-cat backbone P3
  - [-1, 1, SCDown, [512, 3, 2]] # 69
  - [[-1, 39, 19, 18, 55], 1, Concat, [1]] # 70
  - [-1, 3, C2fCIB, [1024, True, True]] # 71 (P5/32-large)

  - [[63, 67, 71], 1, Detect, [nc]] # Detect(P3, P4, P5)