# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0
  - [0, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 1
  - [0, 1, nn.Upsample, [None, 0.25, "bilinear"]] # 2
  - [0, 1, nn.Upsample, [None, 0.125, "bilinear"]] # 3
  - [0, 1, nn.Upsample, [None, 0.0625, "bilinear"]] # 4
  - [0, 1, nn.Upsample, [None, 0.03125, "bilinear"]] # 5
  
  - [1, 1, Conv, [64, 3, 2]] # 6-z1-0
  - [1, 1, Conv, [64, 3, 2]] # 7-z1-0
  - [[-1, -2], 1, Concat, [1]] # 8
  - [-1, 3, C2fS, [64, True]] # 9

  - [1, 1, Conv, [64, 3, 2]] # 10-z1-1
  - [1, 1, Conv, [64, 3, 2]] # 11-z1-1
  - [[-1, -2], 1, Concat, [1]] # 12
  - [-1, 3, C2fS, [64, True]] # 13

  - [2, 1, Conv, [64, 3, 2]] # 14-z2-0
  - [2, 1, Conv, [64, 3, 2]] # 15-z2-0
  - [[-1, -2], 1, Concat, [1]] # 16
  - [-1, 3, C2fS, [64, True]] # 17

  - [2, 1, Conv, [64, 3, 2]] # 18-z2-1
  - [2, 1, Conv, [64, 3, 2]] # 19-z2-1
  - [[-1, -2], 1, Concat, [1]] # 20
  - [-1, 3, C2fS, [64, True]] # 21

  - [3, 1, Conv, [64, 3, 2]] # 22-z3-0
  - [3, 1, Conv, [64, 3, 2]] # 23-z3-0
  - [[-1, -2], 1, Concat, [1]] # 24
  - [-1, 3, C2fS, [64, True]] # 25

  - [3, 1, Conv, [64, 3, 2]] # 26-z3-1
  - [3, 1, Conv, [64, 3, 2]] # 27-z3-1
  - [[-1, -2], 1, Concat, [1]] # 28
  - [-1, 3, C2fS, [64, True]] # 29

  - [4, 1, Conv, [64, 3, 2]] # 30-z4-0
  - [4, 1, Conv, [64, 3, 2]] # 31-z4-0
  - [[-1, -2], 1, Concat, [1]] # 32
  - [-1, 3, C2fS, [64, True]] # 33

  - [4, 1, Conv, [64, 3, 2]] # 34-z4-1
  - [4, 1, Conv, [64, 3, 2]] # 35-z4-1
  - [[-1, -2], 1, Concat, [1]] # 36
  - [-1, 3, C2fS, [64, True]] # 37



  - [0, 1, ConvS, [64, 3, 2]] # 38-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 39-P2/4
  - [[-1, 9], 1, Concat, [1]] # 40
  - [-1, 3, C2fS, [128, True]] # 41
  - [[-1, 13], 1, Concat, [1]] # 42
  - [-1, 1, Conv, [256, 3, 2]] # 43-P3/8
  - [[-1, 17], 1, Concat, [1]] # 44
  - [-1, 6, C2fS, [256, True]] # 45
  - [[-1, 21], 1, Concat, [1]] # 46
  - [-1, 1, Conv, [512, 3, 2]] # 47-P4/16
  - [[-1, 25], 1, Concat, [1]] # 48
  - [-1, 6, C2fS, [512, True]] # 49
  - [[-1, 29], 1, Concat, [1]] # 50
  - [-1, 1, Conv, [1024, 3, 2]] # 51-P5/32
  - [[-1, 33], 1, Concat, [1]] # 52
  - [-1, 3, C2fS, [1024, True]] # 53
  - [[-1, 37], 1, Concat, [1]] # 54
  - [-1, 1, SPPF, [1024, 5]] # 55

# YOLOv8.0n head
head:
  - [3, 1, Conv, [64, 3, 2]] # 56-z3-1
  - [3, 1, Conv, [64, 3, 2]] # 57-z3-1
  - [[-1, -2], 1, Concat, [1]] # 58
  - [-1, 3, C2fS, [64, True]] # 59

  - [2, 1, Conv, [64, 3, 2]] # 60-z2-1
  - [2, 1, Conv, [64, 3, 2]] # 61-z2-1
  - [[-1, -2], 1, Concat, [1]] # 62
  - [-1, 3, C2fS, [64, True]] # 63

  - [2, 1, Conv, [64, 3, 2]] # 64-z2-1
  - [2, 1, Conv, [64, 3, 2]] # 65-z2-1
  - [[-1, -2], 1, Concat, [1]] # 66
  - [-1, 3, C2fS, [64, True]] # 67

  - [3, 1, Conv, [64, 3, 2]] # 68-z3-1
  - [3, 1, Conv, [64, 3, 2]] # 69-z3-1
  - [[-1, -2], 1, Concat, [1]] # 70
  - [-1, 3, C2fS, [64, True]] # 71

  - [3, 1, Conv, [64, 3, 2]] # 72-z3-1
  - [3, 1, Conv, [64, 3, 2]] # 73-z3-1
  - [[-1, -2], 1, Concat, [1]] # 74
  - [-1, 3, C2fS, [64, True]] # 75

  - [4, 1, Conv, [64, 3, 2]] # 76-z4-1
  - [4, 1, Conv, [64, 3, 2]] # 77-z4-1
  - [[-1, -2], 1, Concat, [1]] # 78
  - [-1, 3, C2fS, [64, True]] # 79


  - [55, 1, nn.Upsample, [None, 2, "nearest"]] # 80
  - [[-1, 49, 59], 1, Concat, [1]] # 81-cat backbone P4
  - [-1, 3, C2fS, [512]] # 82

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 83
  - [[-1, 45, 63], 1, Concat, [1]] # 84-cat backbone P3
  - [-1, 3, C2fS, [256]] # 85 (P3/8-small)
  
  - [[-1, 67], 1, Concat, [1]] # 86-cat backbone P3
  - [-1, 1, Conv, [256, 3, 2]] # 87
  - [[-1, 82, 71], 1, Concat, [1]] # 88-cat head P4
  - [-1, 3, C2fS, [512]] # 89 (P4/16-medium)
  
  - [[-1, 75], 1, Concat, [1]] # 90-cat backbone P3
  - [-1, 1, Conv, [512, 3, 2]] # 91
  - [[-1, 55, 79], 1, Concat, [1]] # 92-cat head P5
  - [-1, 3, C2fS, [1024]] # 93 (P5/32-large)

  - [[85, 89, 93], 1, Detect, [nc]] # Detect(P3, P4, P5)
