# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0
  - [0, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 1
  - [1, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 2
  - [2, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 3
  - [3, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 4
  - [4, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 5
  
  - [1, 1, Conv, [64, 3, 2]] # 6-z1-0
  - [2, 1, Conv, [64, 3, 1]] # 7-z1-0
  - [[-1, -2], 1, Concat, [1]] # 8
  - [-1, 3, C2fSD, [64, True]] # 9

  - [1, 1, Conv, [64, 3, 2]] # 10-z1-1
  - [2, 1, Conv, [64, 3, 1]] # 11-z1-1
  - [[-1, -2], 1, Concat, [1]] # 12
  - [-1, 3, C2fSD, [64, True]] # 13

  - [2, 1, Conv, [64, 3, 2]] # 14-z2-0
  - [3, 1, Conv, [64, 3, 1]] # 15-z2-0
  - [[-1, -2], 1, Concat, [1]] # 16
  - [-1, 3, C2fSD, [64, True]] # 17

  - [2, 1, Conv, [64, 3, 2]] # 18-z2-1
  - [3, 1, Conv, [64, 3, 1]] # 19-z2-1
  - [[-1, -2], 1, Concat, [1]] # 20
  - [-1, 3, C2fSD, [64, True]] # 21

  - [3, 1, Conv, [64, 3, 2]] # 22-z3-0
  - [4, 1, Conv, [64, 3, 1]] # 23-z3-0
  - [[-1, -2], 1, Concat, [1]] # 24
  - [-1, 3, C2fSD, [64, True]] # 25

  - [3, 1, Conv, [64, 3, 2]] # 26-z3-1
  - [4, 1, Conv, [64, 3, 1]] # 27-z3-1
  - [[-1, -2], 1, Concat, [1]] # 28
  - [-1, 3, C2fSD, [64, True]] # 29

  - [4, 1, Conv, [64, 3, 2]] # 30-z4-0
  - [5, 1, Conv, [64, 3, 1]] # 31-z4-0
  - [[-1, -2], 1, Concat, [1]] # 32
  - [-1, 3, C2fSD, [64, True]] # 33

  - [4, 1, Conv, [64, 3, 2]] # 34-z4-1
  - [5, 1, Conv, [64, 3, 1]] # 35-z4-1
  - [[-1, -2], 1, Concat, [1]] # 36
  - [-1, 1, C2fSD, [64, True]] # 37



  - [0, 1, Conv, [64, 3, 2]] # 38-P1/2
  - [1, 1, Conv, [64, 3, 1]] # 39-P1/2
  - [[-1, -2], 1, Concat, [1]] # 40
  - [-1, 1, ConvS, [64, 1, 1]] # 41-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 42-P2/4
  - [[-1, 9], 1, Concat, [1]] # 43
  - [-1, 3, C2fSD, [128, True]] # 44
  - [[-1, 13], 1, Concat, [1]] # 45
  - [-1, 1, Conv, [256, 3, 2]] # 46-P3/8
  - [[-1, 17], 1, Concat, [1]] # 47
  - [-1, 6, C2fSD, [256, True]] # 48

  - [[-1, 21], 1, Concat, [1]] # 49
  - [-1, 1, SCDown, [512, 3, 2]] # 50-P4/16
  - [[-1, 25], 1, Concat, [1]] # 51
  - [-1, 6, C2fSD, [512, True]] # 52

  - [[-1, 29], 1, Concat, [1]] # 53
  - [-1, 1, SCDown, [1024, 3, 2]] # 54-P5/32


  - [33, 1, PSASD, [64, 1]] # 55

  - [[-1, -2, 33], 1, Concat, [1]] # 56
  - [-1, 3, C2fCIB, [1024, True, True]] # 57


  - [37, 1, PSAS, [64, 1]] # 58

  - [[-1, -2, 37], 1, Concat, [1]] # 59
  - [-1, 1, SPPFS, [1024, 5]] # 60
  
  - [[-1], 1, Concat, [1]] # 61
  - [-1, 1, PSAS, [1024]] # 62
  

  - [-1, 1, SCDown, [512, 3, 2]] # 63
  - [-1, 3, C2fSD, [512, True]] #64
  - [-1, 1, Conv, [256, 3, 2]] # 65
  - [-1, 1, ToConvWeight, [256, 4]] #66

  - [-1, 1, SplitConvWeight, [0, 64]] #67
  - [-2, 1, SplitConvWeight, [64, 64]] #68
  - [-3, 1, SplitConvWeight, [128, 64]] #69
  - [-4, 1, SplitConvWeight, [192, 64]] #70


# YOLOv8.0n head
head:
  - [3, 1, Conv, [64, 3, 2]] # 71-z3-1
  - [4, 1, Conv, [64, 3, 1]] # 72-z3-1
  - [[-1, -2], 1, Concat, [1]] # 73
  - [-1, 3, C2fSD, [64, True]] # 74

  - [2, 1, Conv, [64, 3, 2]] # 75-z2-1
  - [3, 1, Conv, [64, 3, 1]] # 76-z2-1
  - [[-1, -2], 1, Concat, [1]] # 77
  - [-1, 3, C2fSD, [64, True]] # 78

  - [2, 1, Conv, [64, 3, 2]] # 79-z2-1
  - [3, 1, Conv, [64, 3, 1]] # 80-z2-1
  - [[-1, -2], 1, Concat, [1]] # 81
  - [-1, 3, C2fSD, [64, True]] # 82

  - [3, 1, Conv, [64, 3, 2]] # 83-z3-1
  - [4, 1, Conv, [64, 3, 1]] # 84-z3-1
  - [[-1, -2], 1, Concat, [1]] # 85
  - [-1, 3, C2fSD, [64, True]] # 86

  - [3, 1, Conv, [64, 3, 2]] # 87-z3-1
  - [4, 1, Conv, [64, 3, 1]] # 88-z3-1
  - [[-1, -2], 1, Concat, [1]] # 89
  - [-1, 3, C2fSD, [64, True]] # 90

  - [4, 1, Conv, [64, 3, 2]] # 91-z4-1
  - [5, 1, Conv, [64, 3, 1]] # 92-z4-1
  - [[-1, -2], 1, Concat, [1]] # 93
  - [-1, 3, C2fSD, [64, True]] # 94


  - [62, 1, nn.Upsample, [None, 2, "nearest"]] # 95
  - [[-1, 52, 74], 1, Concat, [1]] # 96-cat backbone P4
  - [[-1, 67], 1, DynamicConvS, [64]] # 97
  - [[-1, -2], 1, Concat, [1]] # 98
  - [-1, 3, C2fSD, [512]] # 99

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 100
  - [[-1, 48, 78], 1, Concat, [1]] # 101-cat backbone P3
  - [[-1, 68], 1, DynamicConvS, [64]] # 102
  - [[-1, -2], 1, Concat, [1]] # 103
  - [-1, 3, C2fSD, [256]] # 104 (P3/8-small)
  
  - [[-1, 82], 1, Concat, [1]] # 105-cat backbone P3
  - [-1, 1, Conv, [256, 3, 2]] # 106
  - [[-1, 99, 86], 1, Concat, [1]] # 107-cat head P4
  - [[-1, 69], 1, DynamicConvS, [64]] # 108
  - [[-1, -2], 1, Concat, [1]] # 109
  - [-1, 3, C2fSD, [512]] # 110 (P4/16-medium)
  
  - [[-1, 90], 1, Concat, [1]] # 111-cat backbone P3
  - [-1, 1, SCDown, [512, 3, 2]] # 112
  - [[-1, 62, 94], 1, Concat, [1]] # 113-cat head P5
  - [[-1, 70], 1, DynamicConvS, [64]] # 114
  - [[-1, -2], 1, Concat, [1]] # 115
  - [-1, 3, C2fCIB, [1024, True, True]] # 116 (P5/32-large)

  - [[104, 110, 116], 1, Detect, [nc]] # Detect(P3, P4, P5)
