# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0
  - [0, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 1
  - [0, 1, nn.Upsample, [None, 0.25, "bilinear"]] # 2
  - [0, 1, nn.Upsample, [None, 0.125, "bilinear"]] # 3
  - [0, 1, nn.Upsample, [None, 0.0625, "bilinear"]] # 4
  - [0, 1, nn.Upsample, [None, 0.03125, "bilinear"]] # 5
  
  - [2, 1, ConvS, [64, 3, 1]] # 6-z1-0
  - [-1, 3, C2fS, [64, True]] # 7

  - [2, 1, ConvS, [64, 3, 1]] # 8-z1-1
  - [-1, 3, C2fS, [64, True]] # 9

  - [3, 1, ConvS, [64, 3, 1]] # 10-z2-0
  - [-1, 3, C2fS, [64, True]] # 11

  - [3, 1, ConvS, [64, 3, 1]] # 12-z2-1
  - [-1, 3, C2fS, [64, True]] # 13

  - [4, 1, ConvS, [64, 3, 1]] # 14-z3-0
  - [-1, 3, C2fS, [64, True]] # 15

  - [4, 1, ConvS, [64, 3, 1]] # 16-z3-1
  - [-1, 3, C2fS, [64, True]] # 17

  - [5, 1, ConvS, [64, 3, 1]] # 18-z4-0
  - [-1, 3, C2fS, [64, True]] # 19

  - [5, 1, ConvS, [64, 3, 1]] # 20-z4-1
  - [-1, 3, C2fS, [64, True]] # 21



  - [0, 1, ConvS, [64, 3, 2]] # 22-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 23-P2/4
  - [[-1, 7], 1, Concat, [1]] # 24
  - [-1, 3, C2fS, [128, True]] # 25
  - [[-1, 9], 1, Concat, [1]] # 26
  - [-1, 1, Conv, [256, 3, 2]] # 27-P3/8
  - [[-1, 11], 1, Concat, [1]] # 28
  - [-1, 6, C2fS, [256, True]] # 29
  - [[-1, 13], 1, Concat, [1]] # 30
  - [-1, 1, Conv, [512, 3, 2]] # 31-P4/16
  - [[-1, 15], 1, Concat, [1]] # 32
  - [-1, 6, C2fS, [512, True]] # 33
  - [[-1, 17], 1, Concat, [1]] # 34
  - [-1, 1, Conv, [1024, 3, 2]] # 35-P5/32
  - [[-1, 19], 1, Concat, [1]] # 36
  - [-1, 3, C2fS, [1024, True]] # 37
  - [[-1, 21], 1, Concat, [1]] # 38
  - [-1, 1, SPPF, [1024, 5]] # 39

# YOLOv8.0n head
head:
  - [4, 1, ConvS, [64, 3, 1]] # 40-z3-1
  - [-1, 3, C2fS, [64, True]] # 41

  - [3, 1, ConvS, [64, 3, 1]] # 42-z2-1
  - [-1, 3, C2fS, [64, True]] # 43

  - [3, 1, ConvS, [64, 3, 1]] # 44-z2-1
  - [-1, 3, C2fS, [64, True]] # 45

  - [4, 1, ConvS, [64, 3, 1]] # 46-z3-1
  - [-1, 3, C2fS, [64, True]] # 47

  - [4, 1, ConvS, [64, 3, 1]] # 48-z3-1
  - [-1, 3, C2fS, [64, True]] # 49

  - [5, 1, ConvS, [64, 3, 1]] # 50-z4-1
  - [-1, 3, C2fS, [64, True]] # 51


  - [39, 1, nn.Upsample, [None, 2, "nearest"]] # 52
  - [[-1, 33, 41], 1, Concat, [1]] # 53-cat backbone P4
  - [-1, 3, C2fS, [512]] # 54

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 55
  - [[-1, 29, 43], 1, Concat, [1]] # 56-cat backbone P3
  - [-1, 3, C2fS, [256]] # 57 (P3/8-small)
  
  - [[-1, 45], 1, Concat, [1]] # 58-cat backbone P3
  - [-1, 1, Conv, [256, 3, 2]] # 59
  - [[-1, 54, 47], 1, Concat, [1]] # 60-cat head P4
  - [-1, 3, C2fS, [512]] # 61 (P4/16-medium)
  
  - [[-1, 49], 1, Concat, [1]] # 62-cat backbone P3
  - [-1, 1, Conv, [512, 3, 2]] # 63
  - [[-1, 39, 51], 1, Concat, [1]] # 64-cat head P5
  - [-1, 3, C2fS, [1024]] # 65 (P5/32-large)

  - [[57, 61, 65], 1, Detect, [nc]] # Detect(P3, P4, P5)
