# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0
  - [0, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 1
  - [1, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 2
  - [2, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 3
  - [3, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 4
  - [4, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 5
  
  - [1, 1, Conv, [64, 3, 2]] # 6-z1-0
  - [2, 1, Conv, [64, 3, 1]] # 7-z1-0
  - [[-1, -2], 1, Concat, [1]] # 8
  - [-1, 3, C2fSD, [64, True]] # 9
  - [-2, 3, C2fSD, [64, True]] # 10

  - [2, 1, Conv, [64, 3, 2]] # 11-z2-0
  - [3, 1, Conv, [64, 3, 1]] # 12-z2-0
  - [[-1, -2], 1, Concat, [1]] # 13
  - [-1, 3, C2fSD, [64, True]] # 14
  - [-2, 3, C2fSD, [64, True]] # 15
  - [-3, 3, C2fSD, [64, True]] # 16
  - [-4, 3, C2fSD, [64, True]] # 17

  - [3, 1, Conv, [64, 3, 2]] # 18-z3-0
  - [4, 1, Conv, [64, 3, 1]] # 19-z3-0
  - [[-1, -2], 1, Concat, [1]] # 20
  - [-1, 3, C2fSD, [64, True]] # 21
  - [-2, 3, C2fSD, [64, True]] # 22
  - [-3, 3, C2fSD, [64, True]] # 23
  - [-4, 3, C2fSD, [64, True]] # 24
  - [-5, 3, C2fSD, [64, True]] # 25

  - [4, 1, Conv, [64, 3, 2]] # 26-z4-0
  - [5, 1, Conv, [64, 3, 1]] # 27-z4-0
  - [[-1, -2], 1, Concat, [1]] # 28
  - [-1, 3, C2fSD, [64, True]] # 29
  - [-2, 1, C2fSD, [64, True]] # 30
  - [-3, 1, C2fSD, [64, True]] # 31



  - [0, 1, Conv, [64, 3, 2]] # 32-P1/2
  - [1, 1, Conv, [64, 3, 1]] # 33-P1/2
  - [[-1, -2], 1, Concat, [1]] # 34
  - [-1, 1, ConvS, [64, 1, 1]] # 35-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 36-P2/4
  - [[-1, 9], 1, Concat, [1]] # 37
  - [-1, 3, C2fSD, [128, True]] # 38
  - [[-1, 10], 1, Concat, [1]] # 39
  - [-1, 1, Conv, [256, 3, 2]] # 40-P3/8
  - [[-1, 14], 1, Concat, [1]] # 41
  - [-1, 6, C2fSD, [256, True]] # 42

  - [[-1, 15], 1, Concat, [1]] # 43
  - [-1, 1, SCDown, [512, 3, 2]] # 44-P4/16
  - [[-1, 21], 1, Concat, [1]] # 45
  - [-1, 6, C2fSD, [512, True]] # 46

  - [[-1, 22], 1, Concat, [1]] # 47
  - [-1, 1, SCDown, [1024, 3, 2]] # 48-P5/32


  - [29, 1, PSASD, [64, 1]] # 49

  - [[-1, -2, 29], 1, Concat, [1]] # 50
  - [-1, 3, C2fCIB, [1024, True, True]] # 51


  - [30, 1, PSAS, [64, 1]] # 52

  - [[-1, -2, 30], 1, Concat, [1]] # 53
  - [-1, 1, SPPFS, [1024, 5]] # 54
  
  - [[-1], 1, Concat, [1]] # 55
  - [-1, 1, PSAS, [1024]] # 56
  

  - [-1, 1, SCDown, [512, 3, 2]] # 57
  - [-1, 3, PSAS, [512]] #58
  - [-1, 1, SCDown, [512, 3, 2]] # 59
  - [-1, 1, ToConvWeight, [384, 6]] #60

  - [-1, 1, SplitConvWeight, [0, 64]] #61
  - [-2, 1, SplitConvWeight, [64, 64]] #62
  - [-3, 1, SplitConvWeight, [128, 64]] #63
  - [-4, 1, SplitConvWeight, [192, 64]] #64
  - [-5, 1, SplitConvWeight, [256, 64]] #65
  - [-6, 1, SplitConvWeight, [320, 64]] #66


# YOLOv8.0n head
head:
  - [[23, 61], 1, DynamicThroughConvS, [64]] # 67

  - [[16, 62], 1, DynamicThroughConvS, [64]] # 68

  - [[17, 63], 1, DynamicThroughConvS, [64]] # 69

  - [[24, 64], 1, DynamicThroughConvS, [64]] # 70

  - [[25, 65], 1, DynamicThroughConvS, [64]] # 71

  - [[31, 66], 1, DynamicThroughConvS, [64]] # 72


  - [56, 1, nn.Upsample, [None, 2, "nearest"]] # 73
  - [[-1, 46, 23, 67], 1, Concat, [1]] # 74
  - [-1, 3, C2fSD, [512]] # 75

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 76
  - [[-1, 42, 16, 68], 1, Concat, [1]] # 77
  - [-1, 3, C2fSD, [256]] # 78 (P3/8-small)
  
  - [[-1, 17, 69], 1, Concat, [1]] # 79-cat backbone P3
  - [-1, 1, Conv, [256, 3, 2]] # 80
  - [[-1, 75, 24, 70], 1, Concat, [1]] # 81
  - [-1, 3, C2fSD, [512]] # 82 (P4/16-medium)
  
  - [[-1, 25, 71], 1, Concat, [1]] # 83-cat backbone P3
  - [-1, 1, SCDown, [512, 3, 2]] # 84
  - [[-1, 56, 31, 72], 1, Concat, [1]] # 85
  - [-1, 3, C2fCIB, [1024, True, True]] # 86 (P5/32-large)

  - [[78, 82, 86], 1, Detect, [nc]] # Detect(P3, P4, P5)