# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0
  - [0, 1, nn.Upsample, [None, 0.5, "bilinear"]] # 1
  - [0, 1, nn.Upsample, [None, 0.25, "bilinear"]] # 2
  - [0, 1, nn.Upsample, [None, 0.125, "bilinear"]] # 3
  - [0, 1, nn.Upsample, [None, 0.0625, "bilinear"]] # 4
  - [0, 1, nn.Upsample, [None, 0.03125, "bilinear"]] # 5
  
  - [2, 1, ConvS, [64, 3, 1]] # 6-z1-0
  - [2, 1, ConvS, [64, 3, 1]] # 7-z1-1
  - [3, 1, ConvS, [64, 3, 1]] # 8-z2-0
  - [3, 1, ConvS, [64, 3, 1]] # 9-z2-1
  - [4, 1, ConvS, [64, 3, 1]] # 10-z3-0
  - [4, 1, ConvS, [64, 3, 1]] # 11-z3-1
  - [5, 1, ConvS, [64, 3, 1]] # 12-z4-0
  - [5, 1, ConvS, [64, 3, 1]] # 13-z4-1


  - [0, 1, ConvS, [64, 3, 2]] # 14-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 15-P2/4
  - [[-1, 6], 1, Concat, [1]] # 16
  - [-1, 3, C2fS, [128, True]] # 17
  - [[-1, 7], 1, Concat, [1]] # 18
  - [-1, 1, Conv, [256, 3, 2]] # 19-P3/8
  - [[-1, 8], 1, Concat, [1]] # 20
  - [-1, 6, C2fS, [256, True]] # 21
  - [[-1, 9], 1, Concat, [1]] # 22
  - [-1, 1, Conv, [512, 3, 2]] # 23-P4/16
  - [[-1, 10], 1, Concat, [1]] # 24
  - [-1, 6, C2fS, [512, True]] # 25
  - [[-1, 11], 1, Concat, [1]] # 26
  - [-1, 1, Conv, [1024, 3, 2]] # 27-P5/32
  - [[-1, 12], 1, Concat, [1]] # 28
  - [-1, 3, C2fS, [1024, True]] # 29
  - [[-1, 13], 1, Concat, [1]] # 30
  - [-1, 1, SPPF, [1024, 5]] # 31

# YOLOv8.0n head
head:
  - [4, 1, ConvS, [64, 3, 1]] # 32-z3-1
  - [3, 1, ConvS, [64, 3, 1]] # 33-z2-1
  - [3, 1, ConvS, [64, 3, 1]] # 34-z2-1
  - [4, 1, ConvS, [64, 3, 1]] # 35-z3-1
  - [4, 1, ConvS, [64, 3, 1]] # 36-z3-1
  - [5, 1, ConvS, [64, 3, 1]] # 37-z4-1

  - [31, 1, nn.Upsample, [None, 2, "nearest"]] # 38
  - [[-1, 25, 32], 1, Concat, [1]] # 39-cat backbone P4
  - [-1, 3, C2fS, [512]] # 40

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 41
  - [[-1, 21, 33], 1, Concat, [1]] # 42-cat backbone P3
  - [-1, 3, C2fS, [256]] # 43 (P3/8-small)
  
  - [[-1, 34], 1, Concat, [1]] # 44-cat backbone P3
  - [-1, 1, Conv, [256, 3, 2]] # 45
  - [[-1, 40, 35], 1, Concat, [1]] # 46-cat head P4
  - [-1, 3, C2fS, [512]] # 47 (P4/16-medium)
  
  - [[-1, 36], 1, Concat, [1]] # 48-cat backbone P3
  - [-1, 1, Conv, [512, 3, 2]] # 49
  - [[-1, 31, 37], 1, Concat, [1]] # 50-cat head P5
  - [-1, 3, C2fS, [1024]] # 51 (P5/32-large)

  - [[43, 47, 51], 1, Detect, [nc]] # Detect(P3, P4, P5)
