# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv5703n summary: 600 layers,  3265664 parameters,  3265648 gradients,   10.5 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []] # 0



  - [0, 1, ConvS, [64, 3, 2]] # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 3, C2fSD, [128, True]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2fSD, [256, True]] # 5

  - [-1, 1, SCDown, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C2fSD, [512, True]] # 7

  - [-1, 1, SCDown, [1024, 3, 2]] # 8-P5/32
  - [-1, 3, C2fSCIB, [1024, True, True]] # 9
  - [-1, 1, SPPFS, [1024, 5]] # 10
  - [-1, 1, PSAS, [1024]] # 11
  
  
  - [-1, 1, SCDown, [512, 3, 2]] # 12
  - [-1, 1, PSAS, [512]] #13
  - [-1, 1, SCDown, [512, 3, 2]] # 14
  - [-1, 1, ToConvWeight, [384, 6]] #15

  - [-1, 1, SplitConv2dResult, [0, 128]] #16
  - [-2, 1, SplitConv2dResult, [128, 192]] #17
  - [-3, 1, SplitConv2dResult, [320, 64]] #18


# YOLOv8.0n head
head:
  - [[5, 16], 1, DynamicThroughConvS, [128, 1, 0.1]] ##19
  - [-1, 1, SplitConv2dResult, [0, 64]] ##20
  - [-2, 1, SplitConv2dResult, [64,64]] ##21
  
  - [[7, 17], 1, DynamicThroughConvS, [192, 1, 0.1]] # 22
  - [-1, 1, SplitConv2dResult, [0,  64]] ##23
  - [-2, 1, SplitConv2dResult, [64, 64]] ##24
  - [-3, 1, SplitConv2dResult, [128,64]] ##25

  - [[11, 18], 1, DynamicThroughConvS, [64, 1, 0.1]] ##26

  
  - [11, 1, nn.Upsample, [None, 2, "nearest"]] # 27
  - [[-1, 7, 23], 1, Concat, [1]] #[[-1, 37, 17, 57], 1, Concat, [1]] # 28
  - [-1, 3, C2fSD, [512]] # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] ##30
  - [[-1, 5, 20], 1, Concat, [1]] #[[-1, 33, 13, 54], 1, Concat, [1]] # 31
  - [-1, 3, C2fSD, [256]] # 32 (P3/8-small)
  
  - [[-1, 21], 1, Concat, [1]] # 33
  - [-1, 1, Conv, [256, 3, 2]] # 34
  - [[-1, 29, 24], 1, Concat, [1]] #[[-1, 63, 17, 58], 1, Concat, [1]] # 35
  - [-1, 3, C2fSD, [512]] # 36 (P4/16-medium)
  
  - [[-1, 25], 1, Concat, [1]] # 37
  - [-1, 1, SCDown, [512, 3, 2]] # 38
  - [[-1, 11, 26], 1, Concat, [1]] #[[-1, 45, 21, 22, 60], 1, Concat, [1]] # 39
  - [-1, 3, C2fCIB, [1024, True, True]] # 40 (P5/32-large)

  - [[32, 36, 40], 1, Detect, [nc]] # Detect(P3, P4, P5)